{
    "4": {
        "title": "Engaging Red Hat Support",
        "multipage": true,
        "launchTour": true,
        "overlayOpacity": 0.1,
        "doneLabel": "Finish",
        "steps": [{
            "intro": "<h3 class='lead-in'>Welcome!</h3><p>This self-paced tour will guide you through the process and policies associated with engaging Red Hat Support using the Customer Portal case management system.</p>",
            "tooltipClass": "tooltip-md",
            "path": "/support/cases/",
            "hash": "#/case/list"
        }, {
            "title": "Support Cases",
            "element": "#nav-support",
            "intro": "The support case management system is accessible from the Support Cases link. If you have previous cases they will be displayed here. You can search for a case, filter by case group, open, closed or all cases.<br><br>Use the Create a New Support Case button to initiate the case creation process.",
            "path": "/support/cases/",
            "hash": "#/case/list"
        }, {
            "title": "Creating Cases",
            "element": "#nav-support",
            "_element": "#rha-case-main-options",
            "intro": "Select product, version, and give the case a name and a detailed description. Attaching logs, an sos report, or other diagnostics files is highly recommended and results in faster average resolution times.",
            "path": "/support/cases/",
            "hash": "#/case/new",
            "before": "waitThenRefresh",
            "on": "loadRecommendations",
            "docked": true
        }, {
            "title": "Recommendations",
            "element": "#page-wrap",
            "_element": "#rha-recommendation-section",
            "intro": "As you type your case name and description, you will see solution recommendations dynamically update directing you to content which may address your concern.",
            "path": "/support/cases/",
            "hash": "#/case/new",
            "before": "loadRecommendations",
            "position": "left",
            "on": "waitThenRefresh"
        }, {
            "title": "Case Options",
            "element": "#page-wrap",
            "_element": "#rha-case-more-options",
            "intro": "Select Support Level, Severity, and then add any other users you'd like to receive notifications on the case. If your account has case groups set up, you can also select a group and the case will only be visible to the users in that Case Group. Once you click Submit, the case will be created and assigned a case number you may use as a reference.",
            "path": "/support/cases/",
            "hash": "#/case/new",
            "before": "waitThenRefresh",
            "docked": true
        }, {
            "title": "Production SLAs",
            "intro": "Understanding the Support Hours of Coverage and Support Level Agreements is crucial to knowing what to expect from Red Hat Support in the way of engagement and response times, based on the level of support defined by your subscriptions.<br><br>The Production SLAs are found under Products & Services, Support Policies.",
            "path": "/support/offerings/production/sla",
            "docked": true
        }, {
            "title": "Escalations",
            "intro": "If circumstances dictate that you need to raise awareness by means of an escalation, the information on this page will direct you through the process of notifying Red Hat Support management.<br><br>The Escalation Process is found under Products & Services, Support Policies.",
            "path": "/support/policy/mgt_escalation/",
            "docked": true
        }],
        "callBacks": {
            "before": "reset",
            "on": "ensurePath",
            "exit": "returnToLaunch"
        },
        "hideMobile": "767",
        "disableInteraction": true,
        "exitOnOverlayClick": false
    }
}
